In [68]:
import pandas as pd # structured data analysis

In [67]:
import numpy as np ## array operations

Array

In [69]:
num = np.array([34,12,37,65,48,79,15])

In [73]:
num = np.array([34,12,37,65,48,79,15], dtype=np.int16)

In [74]:
num

array([34, 12, 37, 65, 48, 79, 15], dtype=int16)

In [75]:
num.dtype

dtype('int16')

In [76]:
num[2]

37

Series

In [4]:
r = pd.Series([1,2,3,4,5,])
n = pd.Series(['prem','raj','kiran','priya','asha'])
m = pd.Series([67.89,73.57,71.56,67.34,66.66])

In [77]:
r

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [78]:
n

0     prem
1      raj
2    kiran
3    priya
4     asha
dtype: object

In [79]:
m

0    67.89
1    73.57
2    71.56
3    67.34
4    66.66
dtype: float64

In [80]:
type(m)

pandas.core.series.Series

In [82]:
m[4]

66.66

In [8]:
df = pd.DataFrame({
    'roll': r,
    'name': n,
    'marks': m
})

In [9]:
df

   roll   name  marks
0     1   prem  67.89
1     2    raj  73.57
2     3  kiran  71.56
3     4  priya  67.34
4     5   asha  66.66

In [10]:
df.shape

(5, 3)

In [11]:
df.dtypes

roll       int64
name      object
marks    float64
dtype: object

In [12]:
type(df)

pandas.core.frame.DataFrame

In [13]:
####Structured Data Analysis

In [14]:
import os
os.getcwd()

'C:\\Users\\joshi'

In [16]:
##### Import the data

In [52]:
df1 = pd.read_csv('student.csv')

In [53]:
df1

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [48]:
dfn = pd.read_csv('student1.csv')

In [49]:
dfn

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [25]:
cols= ['A','B','C','D','E']

In [31]:
df2 = pd.read_csv('student1.csv', names=cols)

In [32]:
df2

    A        B   C      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [28]:
df3 = pd.read_csv('student3.tsv')

In [30]:
df3

  roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19
3     4\tajinkya\tTE\t69.66\t20
4        5\tasha\tTE\t63.28\t20
5      6\tayesha\tBE\t49.55\t20
6        7\tamar\tBE\t65.34\t19
7       8\tamita\tBE\t68.33\t23
8        9\tamol\tTE\t56.75\t20
9      10\tanmol\tBE\t78.66\t21

In [36]:
df4 = pd.read_csv('student3.csv')

In [37]:
df4

    roll     name class  marks    age
0      1     anil    TE   56.77  22.0
1      2     amit    TE   59.77  21.0
2      3   aniket    BE   76.88  19.0
3      4  ajinkya    TE   69.66  20.0
4      5     asha    TE   63.28   NaN
5      6   ayesha    BE     NaN  20.0
6      7     amar    BE   65.34  19.0
7      8    Amita    be   68.33  23.0
8      9     amol    TE   56.75  20.0
9      9     amol    TE   56.75  20.0
10    10    anmol    BE   78.66   NaN
11    11   surbhi    TE     NaN  23.0
12    12    Sujay    TE   74.12  22.0
13    13  subhash    be   88.45  21.0
14    14   sachin   NaN   59.33  21.0
15    15  shalini    TE   63.45  20.0

In [38]:
df5 = pd.read_csv('student3.tsv', sep='\t')

In [39]:
df5

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [40]:
df6 = pd.read_csv('https://gist.githubusercontent.com/justimchung/9b98c69b30600a46daa6d2e827c31b56/raw/4b1f08ba9b00a2fcd3f7ced9cf9e59062f489c3a/student.csv ')

In [41]:
df6

  Unnamed: 0    Name  height  weight  sex       bdate       city major
0   s1234567   Peter   175.0   70.45    1   1980/4/30     Tainan  CSIE
1   e1234567    Mary   163.0   55.00    2  1981/12/21     Taipei    EE
2   f1357689    John   180.4   80.30    1   1980/5/30     Tainan  Stat
3   e1374659   Keven   182.5   77.60    1  1980/11/19     Taipei    EE
4   s7758347    JoJo   170.3   50.30    2   1980/1/27     Taipei  CSIE
5   s1334987   Emily   168.5   53.60    2  1982/10/13  Kaohsiung  CSIE
6   e1384726  Ubuntu   177.0   68.30    1    1981/7/6  Kaohsiung    EE

In [42]:
df7 = pd.read_excel('student.xlsx')

In [43]:
df7

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

##### using the data farme object attributs methods

In [54]:
df1.shape

(10, 5)

In [55]:
df1.size

50

In [57]:
df1.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [58]:
df1.index

RangeIndex(start=0, stop=10, step=1)

In [59]:
df.dtypes

A      int64
B     object
C     object
D    float64
E      int64
dtype: object

In [60]:
df.T

       0      1       2        3      4       5      6      7      8      9
A      1      2       3        4      5       6      7      8      9     10
B   anil   amit  aniket  ajinkya   asha  ayesha   amar  amita   amol  anmol
C     TE     TE      BE       TE     TE      BE     BE     BE     TE     BE
D  56.77  59.77   76.88    69.66  63.28   49.55  65.34  68.33  56.75  78.66
E     22     21      19       20     20      20     19     23     20     21

In [61]:
df.ndim

2

Functions or methods

In [62]:
df.head()

   A        B   C      D   E
0  1     anil  TE  56.77  22
1  2     amit  TE  59.77  21
2  3   aniket  BE  76.88  19
3  4  ajinkya  TE  69.66  20
4  5     asha  TE  63.28  20

In [63]:
df.tail()

    A       B   C      D   E
5   6  ayesha  BE  49.55  20
6   7    amar  BE  65.34  19
7   8   amita  BE  68.33  23
8   9    amol  TE  56.75  20
9  10   anmol  BE  78.66  21

In [64]:
df.tail(3)

    A      B   C      D   E
7   8  amita  BE  68.33  23
8   9   amol  TE  56.75  20
9  10  anmol  BE  78.66  21